{
  "posts": [
    {
      "title": "davidpeter.me",
      "body": "# davidpeter.me\n\nI created this site first with Ruby on Rails. It was an exercise to learn the framework, similar to what I did with [Canvas of Words](/projects/canvas-of-words) for Django. Since then, I've learned a lot about web development, particularly around accessibility. And after Kickstarter, I started looking for a new job.\n\nTo keep me familiar with programming, I decided to reprogram this site using React, next.js, and good accessibility practices.\n\nI'm into next.js. I found it really easy to create a site from scratch. I did run into difficulty with the routing layer, particularly around how pages are loaded and how that interacts with server-side rendering and exported static sites. And I'm still confused about how packages are bundled for the server versus the client.\n\nFor this site, I implemented three servers centered around a JSON database. First, this site gets its data from the JSON file. Second, [`json-server`](https://github.com/typicode/json-server) edits the JSON file and serves as an API for the third server: the admin. The admin server is an instance of [`react-admin`](https://github.com/marmelab/react-admin) which uses the `json-server` API to talk to the JSON file. Feel free to [inspect the source code on GitHub](https://github.com/sarenji/davidpeter).",
      "publishedAt": "2018-07-17",
      "id": 1,
      "tagId": 3,
      "slug": "david-peter-me"
    },
    {
      "publishedAt": "2010-08-02",
      "title": "Seventy-one years later",
      "body": "# Seventy-one years later\n\n![My grandfather smiling; he looks a bit sad.](/static/images/grandfather.jpg)\n\nMeet Iddy, my grandfather.\n\nHe’s smiling on his birthday. My aunt Doda Orli and my cousin Zehara have given him a birthday card signed by them, my mom, and me.\n\nI wonder what’s going on inside his head. How does it feel, in that moment, to know he’s loved? To know he would father such a large family? To know he would still be alive, seventy-one years later?\n\n_Seventy-one years after Germany invaded Poland, my grandfather stands in a green field he used to play in, surrounded by his grandchildren. Our shirts flap in a cool breeze. You can smell grass and air, dew and flowers. The sun hangs high over Lodz, Poland, wreathing the field with light. Grass and cobblestones gleam, like nothing happened here at all._\n\n_You see my grandfather tell us about the olden days, of what happened to our family nearly three-quarters a century ago. He smiles in the middle of a childhood memory, remembering . . . then his smile fades, his face looks his years._\n\nMy grandfather wasn’t called Iddy then: he’s Ramek, a seven-year-old boy the summer of 1935, seventy-five years ago. He’s playing soccer with his friends at a grassy park edged with trees. A tree and stone mark the sides of a goal. They’re darting after the ball, laughing. And then, someone throws Ramek to the ground. Ramek realizes who it is. His best friend is raining fists down on him, screaming, “You killed our God! You killed our God!” Ramek doesn’t know why his best friend is doing this, and starts to cry.\n\nA day or so earlier, Ramek’s uncle was knived by a drunken neighbor who no longer liked that the uncle was Jewish.\n\nAnti-Semitism has existed in Poland for hundreds of years, and it’s still escalating when, four years later, Germany invades Poland on September 1, 1939, and starts the Second World War.\n\nThe city of Lodz is Germanized and becomes _Litzmannstadt_. In 1940, part of the city is turned into a ghetto. Jews, including Ramek and his family, are moved into the ghetto, barred from the world. The ghetto is a town in chains, where terror reigns. Synagogues burn, bodies hang dead in the streets. Jews are made to wear the Star of David on their fronts and backs and arm—or else they die.\n\nThe ghetto inhabitants become slave laborers for the Nazis, working day and night in support of the German war machine. The supreme head of the Nazi SS troops—Heinrich Himmler—visits the Lodz ghetto and stays in the _Hotel Grand_, the same hotel we stay in seventy-one years later.\n\nIf you wander too close to the ghetto walls, bullets fly.\n\n_My grandfather shows us where he lived during the years enslaved in the ghetto—a crammed one-room apartment on the second floor of a building cracked with ruin. Burn marks riddle the ceiling like bullet holes. Cigarette smoke hangs hot and thick in the air. The kitchen is smaller than my college dorm room. In it lived a man whose wife died. The remaining room is subdivided by a sheet hanging from the ceiling. This room housed two families of four back then—my grandfather’s, and his uncle Leon’s._\n\n_In the suburbs of the city sits the textile factory owned by Kalman Shlomo, my grandfather’s father, where the Nazis came, sixty-eight years before, and found materials hidden in its attic and in the apartment floorboards._\n\nThe Nazis take the materials, packing them up in three days, but they’re hungry for more. So they take Ramek’s father, and beat him until he nearly dies. Ramek’s father won’t spill the secret where more materials are hidden, because there is no secret. There are no materials left. The Nazis took them all.\n\nThey give back Ramek’s father when they don’t beat anything more out of him. Then take him away again.\n\nThere is an apple orchard at the edge of the ghetto, outside the factory in which Ramek and six hundred slave laborers work, surrounded by barbed wire. Ramek and a coworker dig under the wire and sneak apples into britches. Ramek’s pants are filled to bulging, and now, sixty-eight years later, Iddy imitates the pant-bulge of apples with his hands, chuckling, lost in a memory.\n\n_The apple orchard is gone when we visit. A bush marks the spot under which Iddy and his friend dug. The factory Iddy worked for all those years is now an orphanage. Crayoned pictures of the sun and grass and trees by the orphaned children do little to brighten the building, dark despite the sun, because the orphanage itself was drained of color long ago._\n\nA Jewish guard watches Ramek walk back home from work. But when the guard notices the lumps in Ramek’s pants, unmistakably filled with stolen apples, he turns around, looks away. Like he didn’t see anything at all.\n\nRamek’s father keeps turning the stolen apple in his hands. He has not seen an apple in more than three years. Beaten, with a punctured lung, starving and bloody, he still speaks two blessings—one is the _Shechecheyanu_, thanking the Almighty that he’s still alive—before he bites into the apple and tastes the juices flowing into his mouth.\n\nBeing tortured by the Nazis left Kalman Shlomo ill. He’s still ill when the Nazis decide to perform a selection. Anyone in the ghetto who is too old, or too young, anyone too sick, is shipped to Auschwitz. Ramek’s mother brings out some lipstick and dabbles it on the boys’ and their father’s cheeks. Two of Ramek’s cousins, only children, aren’t so lucky: the Nazis pick them out.\n\nThey escape by sliding down and hiding in the building’s outside sewer ditch, a single hole set into the ground, swimming in everyone’s urine and feces. But only that time. The next selection, Nazis force them onto the train to Auschwitz. Iddy never saw them again.\n\nKalman Shlomo is dying. He’s only forty-three. Ramek and Yisrael, both brothers, are standing at their father’s deathbed to hear his last words. “I will never get _nachas_ from these beautiful boys.” I picture him: sad, filled with regret for so many things . . . mainly, that he would not see his children grow up. There must have been so much to say. So much to be there for.\n\nBut Kalman Shlomo had no more time.\n\n_Sixty-seven years of not hearing his father’s voice. Of his father reduced to old pictures and memories. Iddy stands at his father’s and grandfather’s graves. Their memorials are overgrown with bugs and weeds, and two tombstones have fallen and shattered on one grave. We clean away the bugs and weeds, right the tombstones._\n\n_After a long time, Iddy speaks to his father. He looks down at his father’s name. I see the pain in his eyes; they look at Kalman Shlomo’s tomb, and beyond, beyond the old stones—talking to a memory, as if his father is alive again. I feel like crying._\n\nRamek and the factory workers make boots from cow hides for the freezing German soldiers in Russia. They work the whole day to earn only a loaf of bread and a bowl of watery soup for the week. Starving workers crawl desperately to toil one more time. Some, after finally dragging themselves into the factory, die working the machines.\n\nOccasionally, the head of the factory ships workers onto a train for Auschwitz, and they are never seen again.\n\nBy this time, in 1944, the Nazis are losing. The head of the ghetto visits the factory. He says they are moving the factory and all the workers and their families to a safer place, where they will have a better life, because when the Russians come, the workers will all be killed for helping the Nazis. Ramek’s mother and brother want to leave with the factory workers onto a train, so their lives will be saved.\n\nIn reality, the train is headed toward the gas chambers—toward Auschwitz, the Final Solution. After they died, their bodies would be thrown into ovens and burned, to join the remains of the millions dead during the Holocaust. But they didn’t know that then.\n\nSafta, Ramek’s mother, tries to coax Ramek onto the horse wagon bringing people to the train. But Ramek doesn’t want to. Safta asks the Jewish wagon-master what to do. He tells her, “_Panie_, if you can stay, stay.”\n\nToday I have a family.\n\nToday I’m alive.\n\n![A very old, frayed photo](/static/images/shlomo.jpg)\n\n_Kalman Shlomo with his sons.  \n(Ramek is the diminutive for Abraham in Polish.)_",
      "tagId": 2,
      "slug": "seventy-one-years-later",
      "id": 2
    },
    {
      "publishedAt": "2012-05-02",
      "title": "Being deaf",
      "body": "# Being deaf\n\n_A disclaimer: A large majority of this article is outdated, and I no longer hold the same views I once did. However, I'm keeping this article here for posterity. These feelings are real, whether the intent behind them were right or not. But to future readers, I encourage you to research internalized ableism. It's the reason I once felt these things._\n\nAt 21, I’m the youngest employee at 1000memories, the startup where I work[^1]. I’m also their first deaf employee. At a startup, I likely always will be the first. For a startup to succeed, the team must communicate well together. Since I can’t hear, that presents a large challenge for my employers.\n\nOn top of that, there are certain things about being deaf that people have never considered, understate, or are mistaken about — so I must clear up exactly what being deaf means. Not understanding what it means risks my productivity and personal happiness. Being a programmer is my current profession, so there will be concrete examples about how being deaf affects me professionally as well as personally.\n\n## Solitude\n\nI’ve been with 1000memories for almost a year, and I leave in two weeks to attend [Hacker School](http://hackerschool.com/). I still feel lonely sometimes. If your reflex is “everyone feels lonely sometimes,” you would be right. But you would also be understating the loneliness we feel.\n\nDeafness means I don’t understand anyone. When someone talks at lunch, I want to know what they say. I miss out on the daily conversation, the back-and-forth, the friendships made after [propinquity](http://en.wikipedia.org/wiki/Propinquity). And the worst part is that I don’t have a choice in the matter.\n\nFive years ago, I received a cochlear implant: a tiny technological machine implanted into my cochlea that fires electric bursts to help me hear. I had to learn sound all over again. I almost didn’t qualify for the cochlear implant operation because, even at 16, I was considered too old. Teaching a child language gets exponentially harder as they grow. It’s the same with hearing. I still can’t tell the difference between “b” and “g,” among many others. I might never, but there’s no point not trying.\n\nIn the past few months, I’ve felt like I’m the last person to know about things. I’m constantly surprised when something happened or changed. Once, an engineer left to work from Seattle the same week the two other engineers on the team left to present at RailsConf 2012. When I discovered that I would be the only engineer in the office the entire week, it was after everyone else had all gone.\n\nIt seems like a solution is just to ask more questions. I knew the engineer who was presenting at RailsConf Wednesday, but maybe I should have asked who else was going and how long he’d be gone? Maybe. I need to work on getting these questions to occur to me. It’s hard when I still don’t know these people very well, and haven’t learned the social norms because I’ve never heard them.\n\nAnother solution is to somehow know what everyone else is doing. The engineers use Google docs to store priorities and to-do lists. We started using Yammer to keep the team up-to-date. That one isn’t working too well — we get an email about every two weeks by a cofounder to use Yammer more. But the idea is to keep everyone up-to-date. Basically, company-wide toilet tweeting.\n\n## Group conversations\n\nIn an open office like this, it’s very easy to drop in on a conversation and add something. But without understanding what people say, the chance you can do that drops to zero. This is especially problematic in company meetings. The only way I can participate is with access services.\n\n1000memories is still a startup, so we can’t afford full-time access services. But for our most important meetings, the cofounders went through considerable expense to get me transcribers. With them, meetings are a bit better.\n\nSince we work in an open office, parts of the team often chat with each other, especially at lunch. I always miss out on these talks, which are full of snippets of information no matter how bad the signal-to-noise ratio. This is really taken for granted. Any off-topic comment hints at an entire life to discover.\n\nMy best friend, then interning at Causes, kept telling me about random tips he picked up from other programmers because they were always chatting about new tricks they learned. This is how I learned about `git log -S`.\n\nHave I told anyone about these problems? Have I taught anyone how to communicate with me? Yes to both. The result is no one uses the communication method after the initial novelty. The excuse my coworkers use for not practicing is “I need to practice.” And then they keep on talking to you online rather than real life because it’s easier and more familiar. That’s because we’re human, really.\n\nI should have made it clear that Cued Speech was important to me. Startups are busy as bees, and people have other priorities. And I suspect I taught them too far down the line, because it was two months before I would be gone. Something I’ll take away from this experience.\n\nIn a chat with a cofounder, I told him that I felt like I didn’t have friends. I became jealous whenever a coworker talked to another and not me. It felt like a girlfriend talking to another guy. When they laugh and I’m unable to understand why, it feels like a punch in the gut, a giant inside joke I’m not part of. Maybe I should ask to explain the joke, even though most of the humor would be lost, because at least I would _know_.\n\nI participate in conversations less than the quietest person I’ve met — not by choice, entirely. You should never want to be average — unless you are below average. This is a cry for normalcy, when so many others wish to be abnormal.\n\n## Love\n\nBeing deaf especially sucks when it comes to love. You can’t ever love someone unless you’ve talked to them. So how do you communicate effectively? Everything I’ve ever thought of is awkward, because none of them are ever normal. Social norms are norms because they are what people expect.\n\nI’ve talked to people “normally.” It’s hard, it’s error-prone, and we have to repeat a lot. That’s never a good recipe for love. It’s hard to have awesome conversations when you have to repeat every other thing you say and are never sure whether the other person understood.\n\nI could try to find a deaf girl. However, I don’t want my kids to have an increased chance of deafness. Even if they come out hearing, we’d need to make sure they’re raised right — who will teach them how to talk? And I don’t identify with Deaf culture, which takes pride in being deaf. I accept that deafness is part of me, but it’s just there. Like the fact I have black hair.[^2]\n\nI could use an online dating site, like OKCupid. However, these are self-selected pools of people. There is a specific audience that goes to each site, and you still have to learn subtle communication skills which I currently lack.\n\nI could do many other things (and am!) — exercise, dress well, maximize exposure. But in the end, I’m deaf. The most important thing is that I find someone who communicates well with me.\n\n## Job interviews\n\nLet me tell you a story in the present tense.\n\nThis morning, I get my fifth or seventh email from a large company in Washington. The second recruiter’s trying to clarify some things, and she tells me that she’ll be looking for an interrupter [sic] for my over-the-phone interview.\n\nI ask to clarify this point. Since I’m deaf, having an interpreter for a phone interview wouldn’t be very useful since the interpreter would be in Washington and I’m not, right? Would they actually be hiring an interpreter in San Francisco? How was this going to work?\n\nIn her next email, the recruiter delegates me to her manager, the third recruiter. At the end of the email is a copy-pasted message to be sure to fill out the necessary application for the interview. All interns have seen this application. I do not want to fill it out if they botch the interpreter.\n\nHer manager tells me that she’ll contact my college for access services and that we’ll be using Live Meeting for the interview. She’ll even do a test with me.\n\nUnfortunately I have no idea what Live Meeting is. A quick search on Google tells me Live Meeting is basically Skype, but with no clues on how to download it.\n\nI end up never starting the interview.\n\n## Accessibility in interview applications\n\nFor most company interview applications, they ask for a phone number without alternatives. I put a random note where I can. Something like “Since I’m deaf, I can’t do a phone interview, but you can reach me at…” at the end of the “Why do you want to work for us?” question. I never hear back from these. I don’t know if it’s whether they never saw my note, whether they rejected my resume silently, or whether they attempted calling my phone number (which doesn’t take calls).\n\nLast time I applied, even Google didn’t provide alternatives. It was a beta application, though when I emailed a recruiter in charge of my college about it, she was very helpful and understanding.\n\nHR is behind the times. There is no reason interviewing over the phone is better than interviewing on video with typewith.me, Skype, or Gmail chat. I’ve done all of these, and it’s always turned out that the programmers preferred to conduct those interviews this way.\n\nScreencasts, talks, and video tutorials\nWhen I was trying to learn Rails, I soon found out that a large chunk of popular tutorials were uncaptioned screencasts or videos — a huge body of knowledge I’m unable to tap into. Even Khan Academy went uncaptioned until recently when an independent group helped out. So many uncaptioned videos exist because minorities are not prioritized.\n\nSince I can’t listen to talks, I have to make-do with slides. Slides almost never go into the depth a talk does: it’s all surface knowledge.\n\nIn the end, I learned programming by a combination of getting lucky, enrolling in formal classes, poring over books, Googling, finding Stack Overflow, and making things, making things, making things.\n\n## Access services\n\nThere are three layers involved in translation: the messenger herself, the interpreter, and me. I hear what someone says through the lens of someone who probably doesn’t know programming.\n\nAs university subjects get harder, access services get worse. In Probability class a year ago, we learned about second derivatives and gamma probability functions, and the typist that my college hired for this class was typing a transcription indistinguishable from a novel written by a chimpanzee. Typists are not required to learn the prerequisites, nor do they have to learn along with the student. They just type what they think they hear.\n\nIt’s like playing a game of [Telephone](http://en.wikipedia.org/wiki/Telephone_game) — the classic example of lossy communication. Which means it is never, ever as good.\n\nThe only good access service I’ve ever gotten is [Cued Speech](https://en.wikipedia.org/wiki/Cued_speech). In a basic sense, Cued Speech is a system that uses signs for sound. It was invented to battle the spectacularly low deaf literacy rate. (The average reading level of deaf 17- and 18-year-olds is at the fourth grade level.[^3]) With Cued Speech, I see exactly what the messenger says, without ambiguity. The only error arises when the transliterator mishears the person. Unfortunately, in college, I’m not offered Cued Speech due to politics not worth mentioning, and Cued Speech is not widespread.\n\n## Deaf culture\n\nI never considered myself part of Deaf culture. It arose because, I suspect, we were lonely. It’s the same for any minority. Except this time, Deaf culture came together because of a common language everyone could understand — American Sign Language. I’ve heard the stories. Deaf people entering college for the first time. Finding other deaf students. Suddenly, during their first sleepless night, they’re making up for all the conversations they had missed.\n\nSome become angry at the hearing world. They went so long without feeling like they belonged. Without feeling loved.\n\nSome don’t think deafness is a disability; it’s just a way of life. After all, we can do anything except hear. But I don’t want to be part of the Deaf world, which seems so cloistered sometimes. I want to be part of the larger world — and out here, not being able to hear is a pretty significant disadvantage.\n\n## Friends\n\nDespite the constant communication barriers, I’ve really grown into a good programmer during my time at 1000memories. I’ve learned how to communicate with others, what the real world is like, how to do behavior-driven development, mastered JavaScript, and even submitted a patch for Ruby on Rails. They gave me a chance prove myself as a programmer — and, in these past few months, a friend.[^4]\n\nNine months had passed since my inception as a bumbling intern before I admitted to a cofounder that I was feeling lonely. It happened after one social bowling night, when a scheduling mistake caused us to wait in the alley for an hour and a half chatting in a noisy environment. I stood off to the side, feeling stupid, watching my coworkers laugh. I didn’t want to see that. As soon as I collapsed back in my apartment, I cried. Then a little thought went off in my head: Shouldn’t someone know about this? So I wrote an email.\n\nThe next morning the cofounder read my email. He invited me for a chat over breakfast. When he let me into his apartment, I was surprised and a little guilty when I saw his eyes. That moment was the most vulnerable I ever saw him. _Of course, you idiot,_ I thought right then. _Founders get lonely, too._\n\nWe had bagels at his couch. It took a long time before either of us started talking. I began with what my life used to be three years ago, when I was a completely different person. I was so passive and shy I couldn’t look anyone in the eye. I blamed everything. I depended on everyone. I was content to live life as a cog in an industrial machine. I just wanted an easy life and die of old age. Until I went to college.\n\nIn college, I was depressed and bored. I felt like I was missing _something_. Then someone I knew died. And another. I realized I wasn’t missing anything. Happiness is a verb. And now, the me of three years ago wouldn’t be able to recognize who I am.\n\nThe cofounder and I went through what we could do to make my life at work better. Part of my contract involved a budget for speech therapy, something I never took advantage of. I brought up teaching Cued Speech. He mentioned that, at lunch, I could nudge someone and ask what we were talking about. We talked about going back to college, living in the adult world, and finding love.\n\nI walked away feeling like we could be friends.\n\n_This article was featured on [Gizmodo](http://gizmodo.com/5912623/being-deaf). Read the comments on [HackerNews](http://news.ycombinator.com/item?id=4001727)._\n\n[^1]: The founders of 1000memories gave permission to post this to the public, and helped look over this essay with me.\n\n[^2]: This paragraph is the most contested paragraph in the entire article. I also don’t believe in it anymore. I’ve fallen for deaf women before; it doesn’t matter that they were deaf. As they say, love is love.\n\n[^3]: As concluded in a study by the Gallaudet Research Institute. However, it’s 15 years old. The level may have risen since then, but there are no new studies to replace that statistic.\n\n[^4]: My time at 1000memories is the happiest I’ve ever been in my life. The other founder has begun telling me what people said. I joke with my coworkers. A coworker/friend also told me in an IM conversation:\n\n    have i not mentioned this to you?  \n    crap. i hate it when i leave you out of stuff.",
      "tagId": 2,
      "slug": "being-deaf",
      "id": 3
    },
    {
      "publishedAt": "2012-04-03",
      "title": "so small",
      "tagId": 3,
      "body": "# so small\n\nI made a point-and-click game called [so small](http://www.ludumdare.com/compo/ludum-dare-23/?uid=3323), in which you are an arrogant, very white boy. It was made for [Ludum Dare](http://ludumdare.com/compo), a 48-hour contest where you make a game according to a theme. This theme was \"tiny world.\" Every asset must be made by you.\n\n\"so small\" won [#25 out of 1400](http://www.ludumdare.com/compo/ludum-dare-23/?more=1) in humor, and #160 overall.\n\n## About the game\n\n![Picture of the game](/static/images/so_small.png)\n\nYour brother instant-messages you. He says he thinks you both are in a game. That’s when the problems begin.\n\n[Go play](http://www.ludumdare.com/compo/ludum-dare-23/?uid=3323). I made this a long time ago, so it's non-accessible to screenreader and keyboard users. I'm sorry.\n\nI had been drawing for the past few months, and wanted to test out my skills. I was very proud of my progress. This game was not meant to be anything more than pure entertainment.",
      "slug": "so-small",
      "id": 4
    },
    {
      "publishedAt": "2010-08-03",
      "title": "gunpixel",
      "body": "gunpixel was a game made for the first [Node Knockout](http://nodeknockout.com/), a 48-hour contest to make anything using the node.js environment.\n\nIt’s a multiplayer shooter, but everything is a pixel, including you and your bullets.\n\nMy partner and I had to learn how to set up a web server, deploy an application, basic networking theory, and node.js all in less than two days. It went right down to the wire: our last commit was minutes before the contest ended.\n\ngunpixel was an incredible learning experience for me. The game is extremely outdated and has poor networking code, as is tradition for contests. But [the code is open-source](https://github.com/sarenji/gunpixel), so you can check it out anytime.",
      "tagId": 3,
      "slug": "gunpixel",
      "id": 5
    },
    {
      "publishedAt": "2010-03-02",
      "title": "canvasofwords.com",
      "body": "# canvasofwords.com\n\nI had this itch I needed to scratch. I love writing, but I didn’t like the software out there — Tumblr, posterous, Facebook. Blog posting on these sites is littered, I felt, with unnecessary features. Besides, I didn’t even want post titles. I just wanted a box with a “Publish” button.\n\nEventually, I made [canvasofwords.com](https://evening-stream-6633.herokuapp.com/). It was programmed in [Django](https://www.djangoproject.com/) so I would learn more about it.\n\nEventually, friends began to write for it and I scaled the site for multiple authors. I suppose the lack of a title and numerous short posts made for good flash fiction, quick writing exercises. I guess other people found the same use in it I did.\n\nWe mostly stopped writing due to other interests. I let the domain expire in 2016, but let it live on in Heroku.",
      "tagId": 3,
      "slug": "canvas-of-words",
      "id": 6
    },
    {
      "publishedAt": "2012-08-02",
      "title": "Hacker School",
      "body": "# Hacker School\n\n_Author note: Hacker School has been renamed to the Recurse Center. Several years later, my views have changed about certain things, but I still think the Recurse Center is a great place to attend. If you have the chance and the means, I encourage you to go._\n\n> [Hacker School](http://hackerschool.com/) is a three-month, full-time school in New York for becoming a better programmer. We’re free as in beer, and provide space, a little structure, time to focus, and a friendly community of smart builders dedicated to self-improvement.\n> \n> — Hacker School\n\nI joined batch[3]. _(Author note: Now referred to as Summer 2012.)_ Here’s my story.\n\n## How I found out about Hacker School\n\nOne of my best friends randomly instant-messaged me with this:\n\n> **Grant:** https://www.hackerschool.com/blog/1-summer-2012-applications-open im thinking about this\n> \n> not too hard but a little.\n\nSo I checked it out. Hacker School being a home for lonely programmers made me cautious. Admittedly, I was a little lonely, but the reason wasn’t because I had no one to share my programming hobby with. The reason was the same as the underlying reason: In real life, I had almost no one I felt comfortable talking with. People who could understand me. People I could understand.\n\nAfter these three months, I’d say that Hacker School is more than a home for lonely programmers — it’s a place to meet other like-minded people.\n\nGrant and I sent in our applications. But he withdrew a few days later, because Hacker School’s timeframe clashed with Stanford’s spring quarter and NYC was prohibitively expensive. I started to compose an email to cancel too, but scrapped the draft.\n\n## The interviews\n\nThe founders of Hacker School, Nick and Dave, conducted Skype interviews to complement the applications. I sliced intervals of time from 1000memories to interview.[^1] In my email, I told Dave I was deaf. I was a bit nervous about that. But we just instant-messaged on Skype with a video feed on.[^2] He questioned me about culture-fit, and a good chunk was about how to deal with my deafness. The most important thing was whether they could enable me to participate well.\n\nI got scheduled for another interview with Nick. I wasn’t sure if interviews with _both_ founders was normal, but I understood I was more of a risk. I asked about teaching [Cued Speech](http://en.wikipedia.org/wiki/Cued_Speech) before and during Hacker School — I [didn’t want to repeat the same mistake I made](/stories/being-deaf). Nick said the staff would be open to that, but he couldn’t promise the same participation from the students.\n\nA few weeks later, I got accepted. Instead of jumping up and down like a normal person, I agonized about whether I should attend. If I didn’t, I’d just go to Palo Alto and hack with my friends. Maybe even get a driver’s license. But there were two things I neeed to figure out first:\n\n### 1. Is my love for programming real love?\n\nOne of the questions in the interview was, “Do you love programming?” I said yes, because I loved it more than most people I knew. But was it love? I enjoyed writing and drawing equally, if not more. After Hacker School, I’m revisiting these hobbies. Programming wasn’t my first love.\n\nBut now, I have a better sense of what the question is asking. “Love” has become a bit of an exaggerated word. Job postings give off the impression that if you love programming, you dream in binary and your projects are all on GitHub with 1,000 watchers. But if programming is what you love, all that means is that you like programming enough to program for three months at Hacker School and continuously improve.[^3]\n\n### 2. Was I overqualified?\n\nI thought Hacker School was geared more toward beginning programmers. I still think that’s true to an extent. It’s easier for the least experienced programmers at Hacker School to grow. You never want to be the smartest person in a room.\n\nBut if you’re not learning, you’re doing it wrong. There’s so much diversity here — someone will know something you don’t know. Experiences ranged from microcontrollers, Apple II emulators, web development, iPhone development, scientific computing, physics, computer vision, mathematics, and Pokémon.\n\nPeople of all sorts were jumping into all-new languages or projects and learning something they wouldn’t have before. About half of Hacker Schoolers played with Clojure, and a few [submitted a non-trivial addition to support runtime code reflection in the Clojure REPL](https://github.com/clojure/clojurescript/commit/b5b20fdc4fa5c9f8a12e527407a72a7e6957bcd6).\n\nAs for me, I wanted to get exposure to many things. I learned WebGL and GLSL, the shading language that plugs into the GPU. I helped build a robot that flips the room lights, controlled by a phone with Bluetooth. I built a Python IRC bot library used by two other Hacker Schoolers. I contributed to Pry, a new Ruby REPL. I submitted a patch to a pixel editor written in Cocoa. I made webrtc.io to for peer-to-peer video chats. I wrote a viewer for the Mandelbrot set, Julia sets, and a quaternion Julia set. I learned Objective-C, Scala, Io, Clojure, Prolog, and Go.\n\n### The feeling of belonging\n\nIn what still gives me the fuzzy-wuzzies inside, Hacker Schoolers have that rare kind of curiosity for learning. They also put in an effort to make themselves understood. I scheduled a lesson to learn Cued Speech the hour before Hacker School began and told anyone who wanted to learn should come. About half of batch[3] came. That many people have never come to an event like this before.\n\nThe size of the class decreased exponentially as peoples’ skills plateaued, but that doesn’t matter to me. I’ve realized the more important thing is whether we’re comfortable talking to each other, regardless of medium. Sometimes that was with Cued Speech. Sometimes that was typing on a phone. Sometimes that was getting used to the way we talked.\n\nFrom day one, most people were comfortable talking to me. Five years ago, my cousin had told me that this was how normal people were. But it was never normal for me. Some of batch[3] did have some fear and hesitation in their eyes. But as time went on, the nervousness and hesitation disappeared. By the end, I knew everyone.\n\nIn the end-of-Hacker-School party, as we said our goodbyes under a sky twinkling with stars, I had the overwhelming feeling that these people were truly my friends. This is one of the very few times I felt comfortable with anyone, much less a large group such as this. I had told Nick that I disliked going to bars, but in these past three months I’ve gone to bars many times.[^4]\n\n## This is how it should be\n\nbatch[3]‘s balanced gender ratio didn’t seem like a huge deal at the time. It just felt normal, really. But the Monday after Hacker School ended, I checked the student lists for my upcoming college classes on a whim. There is only one girl in each of my Computer Science classes.\n\nThat’s when I started thinking. The gender ratio was one of the small things that contributed to how natural life at Hacker School seemed. How much more real the world seemed. I had felt normal for one of the very first times in my life. I couldn’t help thinking, this is how it should be. This is the way the world should be.\n\n[^1]: I told them I was interviewing. As it turned out, both 1000memories and Hacker School were in the same YC batch. Nick and Dave had slept over at 1000memories’ office before. Our chief engineer had gotten hired at 1000memories through Dave and Nick’s [other startup](http://hackruiter.com/). So I may have had a bit of an unfair advantage in retrospect.\n\n[^2]: He enjoyed the interview if only for how easy writing notes became: just copy-paste sections of the instant-messaging conversation.\n\n[^3]: A fellow Hacker Schooler (now employee!), Allison, [wrote similar thoughts on her blog](http://ideasandmiscellany.blogspot.com/2012/08/should-you-apply-to-hacker-school.html).\n\n[^4]: A Hacker School favorite was Fat Cat. It has ping pong tables, skee ball, and chess. Some of us started playing [Bughouse](http://en.wikipedia.org/wiki/Bughouse_chess), a four-player variant of chess. A random woman joined us, and none of us could ever beat her. Turns out she was a chess grandmaster.",
      "tagId": 2,
      "slug": "hacker-school",
      "id": 7
    }
  ],
  "tags": [
    {
      "title": "Photos",
      "id": 1,
      "slug": "photos"
    },
    {
      "title": "Stories",
      "id": 2,
      "slug": "stories"
    },
    {
      "title": "Projects",
      "id": 3,
      "slug": "projects"
    }
  ]
}